/* rexx */

say 2

do i=1 to 9
  say i 
end

/* a comment's to test matching */


? = 'ADD'; commands.? = '[$2+$1]'
? = 'SUB'; commands.? = '[$2-$1]'
? = 'DIV'; commands.? = '[$2/$1]'
? = 'MUL'; commands.? = '[$2*$1]'
